Ran Plan for dir: `projects/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # module.argocd.helm_release.argocd will be created
+ resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argocd"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                # TLS settings
                server:
                  extraArgs:
                    - --insecure
                configs:
                  params:
                    server.insecure: true
                
                # argocd-vault-plugin
                repoServer:
                  rbac:
                    - verbs:
                        - get
                      apiGroups:
                        - ''
                      resources:
                        - secrets
                
                  # Mount SA token for Kubernets auth
                  # Note: In 2.4.0 onward, there is a dedicated SA for repo-server (not default)
                  # Note: This is not fully supported for Kubernetes < v1.19
                  automountServiceAccountToken: true
                
                  # Each of the embedded YAMLs inside cmp-plugin ConfigMap will be mounted into it's respective plugin sidecar
                  volumes:
                    - configMap:
                        name: cmp-plugin
                      name: cmp-plugin
                    - name: custom-tools
                      emptyDir: {}
                
                  # Download tools
                  initContainers:
                    - name: download-tools
                      image: alpine:3.19 
                      env:
                        - name: AVP_VERSION
                          value: 1.18.0
                      command: [sh, -c]
                      args:
                        - >-
                          apk add --no-cache curl &&
                          curl -L https://github.com/argoproj-labs/argocd-vault-plugin/releases/download/v$(AVP_VERSION)/argocd-vault-plugin_$(AVP_VERSION)_linux_amd64 -o argocd-vault-plugin &&
                          chmod +x argocd-vault-plugin &&
                          mv argocd-vault-plugin /custom-tools/
                      volumeMounts:
                        - mountPath: /custom-tools
                          name: custom-tools
                
                  # sidecar containers
                  extraContainers:
                
                    # argocd-vault-plugin with Helm
                    - name: avp-helm
                      command: [/var/run/argocd/argocd-cmp-server]
                      image: quay.io/argoproj/argocd:v2.7.9
                      securityContext:
                        runAsNonRoot: true
                        runAsUser: 999
                      volumeMounts:
                        - mountPath: /var/run/argocd
                          name: var-files
                        - mountPath: /home/argocd/cmp-server/plugins
                          name: plugins
                        - mountPath: /tmp
                          name: tmp
                
                        # Register plugins into sidecar
                        - mountPath: /home/argocd/cmp-server/config/plugin.yaml
                          subPath: avp-helm.yaml
                          name: cmp-plugin
                
                        # Important: Mount tools into $PATH
                        - name: custom-tools
                          subPath: argocd-vault-plugin
                          mountPath: /usr/local/bin/argocd-vault-plugin
                
                    # argocd-vault-plugin with Kustomize
                    - name: avp-kustomize
                      command: [/var/run/argocd/argocd-cmp-server]
                      image: quay.io/argoproj/argocd:v2.7.9
                      securityContext:
                        runAsNonRoot: true
                        runAsUser: 999
                      volumeMounts:
                        - mountPath: /var/run/argocd
                          name: var-files
                        - mountPath: /home/argocd/cmp-server/plugins
                          name: plugins
                        - mountPath: /tmp
                          name: tmp
                
                        # Register plugins into sidecar
                        - mountPath: /home/argocd/cmp-server/config/plugin.yaml
                          subPath: avp-kustomize.yaml
                          name: cmp-plugin
                
                        # Important: Mount tools into $PATH
                        - name: custom-tools
                          subPath: argocd-vault-plugin
                          mountPath: /usr/local/bin/argocd-vault-plugin
                
                    # argocd-vault-plugin with plain YAML
                    - name: avp
                      command: [/var/run/argocd/argocd-cmp-server]
                      image: quay.io/argoproj/argocd:v2.7.9
                      securityContext:
                        runAsNonRoot: true
                        runAsUser: 999
                      volumeMounts:
                        - mountPath: /var/run/argocd
                          name: var-files
                        - mountPath: /home/argocd/cmp-server/plugins
                          name: plugins
                        - mountPath: /tmp
                          name: tmp
                
                        # Register plugins into sidecar
                        - mountPath: /home/argocd/cmp-server/config/plugin.yaml
                          subPath: avp.yaml
                          name: cmp-plugin
                
                        # Important: Mount tools into $PATH
                        - name: custom-tools
                          subPath: argocd-vault-plugin
                          mountPath: /usr/local/bin/argocd-vault-plugin
                
                # If you face issue with ArgoCD CRDs installation, then uncomment below section to disable it
                #crds:
                #  install: false
            EOT,
        ]
      + verify                     = false
      + version                    = "2.13.4"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.argocd.kubernetes_manifest.argocd_cmp_plugin will be created
+ resource "kubernetes_manifest" "argocd_cmp_plugin" {
      + manifest = {
          + apiVersion = "v1"
          + data       = {
              + "avp-helm.yaml"      = <<-EOT
                    ---
                    apiVersion: argoproj.io/v1alpha1
                    kind: ConfigManagementPlugin
                    metadata:
                      name: argocd-vault-plugin-helm
                    spec:
                      allowConcurrency: true
                    
                      # Note: this command is run _before_ any Helm templating is done, therefore the logic is to check
                      # if this looks like a Helm chart
                      discover:
                        find:
                          command:
                            - sh
                            - "-c"
                            - "find . -name 'Chart.yaml' && find . -name 'values.yaml'"
                      generate:
                        # **IMPORTANT**: passing `${ARGOCD_ENV_HELM_ARGS}` effectively allows users to run arbitrary code in the Argo CD 
                        # repo-server (or, if using a sidecar, in the plugin sidecar). Only use this when the users are completely trusted. If
                        # possible, determine which Helm arguments are needed by your users and explicitly pass only those arguments.
                        command:
                          - sh
                          - "-c"
                          - |
                            helm template $ARGOCD_APP_NAME -n $ARGOCD_APP_NAMESPACE ${ARGOCD_ENV_HELM_ARGS} . |
                            argocd-vault-plugin generate -s argocd:argocd-vault-plugin-credentials --verbose-sensitive-output -
                      lockRepo: false
                EOT
              + "avp-kustomize.yaml" = <<-EOT
                    ---
                    apiVersion: argoproj.io/v1alpha1
                    kind: ConfigManagementPlugin
                    metadata:
                      name: argocd-vault-plugin-kustomize
                    spec:
                      allowConcurrency: true
                    
                      # Note: this command is run _before_ anything is done, therefore the logic is to check
                      # if this looks like a Kustomize bundle
                      discover:
                        find:
                          command:
                            - find
                            - "."
                            - -name
                            - kustomization.yaml
                      generate:
                        command:
                          - sh
                          - "-c"
                          - "kustomize build . | argocd-vault-plugin generate -s argocd:argocd-vault-plugin-credentials --verbose-sensitive-output -"
                      lockRepo: false
                EOT
              + "avp.yaml"           = <<-EOT
                    apiVersion: argoproj.io/v1alpha1
                    kind: ConfigManagementPlugin
                    metadata:
                      name: argocd-vault-plugin
                    spec:
                      allowConcurrency: true
                      discover:
                        find:
                          command:
                            - sh
                            - "-c"
                            - "find . -name '*.yaml' | xargs -I {} grep \"<path\\|avp\\.kubernetes\\.io\" {} | grep ."
                      generate:
                        command:
                          - argocd-vault-plugin
                          - generate
                          - -s
                          - argocd:argocd-vault-plugin-credentials
                          - --verbose-sensitive-output
                          - "."
                      lockRepo: false
                EOT
            }
          + kind       = "ConfigMap"
          + metadata   = {
              + name      = "cmp-plugin"
              + namespace = "argocd"
            }
        }
      + object   = {
          + apiVersion = "v1"
          + binaryData = (known after apply)
          + data       = {
              + "avp-helm.yaml"      = <<-EOT
                    ---
                    apiVersion: argoproj.io/v1alpha1
                    kind: ConfigManagementPlugin
                    metadata:
                      name: argocd-vault-plugin-helm
                    spec:
                      allowConcurrency: true
                    
                      # Note: this command is run _before_ any Helm templating is done, therefore the logic is to check
                      # if this looks like a Helm chart
                      discover:
                        find:
                          command:
                            - sh
                            - "-c"
                            - "find . -name 'Chart.yaml' && find . -name 'values.yaml'"
                      generate:
                        # **IMPORTANT**: passing `${ARGOCD_ENV_HELM_ARGS}` effectively allows users to run arbitrary code in the Argo CD 
                        # repo-server (or, if using a sidecar, in the plugin sidecar). Only use this when the users are completely trusted. If
                        # possible, determine which Helm arguments are needed by your users and explicitly pass only those arguments.
                        command:
                          - sh
                          - "-c"
                          - |
                            helm template $ARGOCD_APP_NAME -n $ARGOCD_APP_NAMESPACE ${ARGOCD_ENV_HELM_ARGS} . |
                            argocd-vault-plugin generate -s argocd:argocd-vault-plugin-credentials --verbose-sensitive-output -
                      lockRepo: false
                EOT
              + "avp-kustomize.yaml" = <<-EOT
                    ---
                    apiVersion: argoproj.io/v1alpha1
                    kind: ConfigManagementPlugin
                    metadata:
                      name: argocd-vault-plugin-kustomize
                    spec:
                      allowConcurrency: true
                    
                      # Note: this command is run _before_ anything is done, therefore the logic is to check
                      # if this looks like a Kustomize bundle
                      discover:
                        find:
                          command:
                            - find
                            - "."
                            - -name
                            - kustomization.yaml
                      generate:
                        command:
                          - sh
                          - "-c"
                          - "kustomize build . | argocd-vault-plugin generate -s argocd:argocd-vault-plugin-credentials --verbose-sensitive-output -"
                      lockRepo: false
                EOT
              + "avp.yaml"           = <<-EOT
                    apiVersion: argoproj.io/v1alpha1
                    kind: ConfigManagementPlugin
                    metadata:
                      name: argocd-vault-plugin
                    spec:
                      allowConcurrency: true
                      discover:
                        find:
                          command:
                            - sh
                            - "-c"
                            - "find . -name '*.yaml' | xargs -I {} grep \"<path\\|avp\\.kubernetes\\.io\" {} | grep ."
                      generate:
                        command:
                          - argocd-vault-plugin
                          - generate
                          - -s
                          - argocd:argocd-vault-plugin-credentials
                          - --verbose-sensitive-output
                          - "."
                      lockRepo: false
                EOT
            }
          + immutable  = (known after apply)
          + kind       = "ConfigMap"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "cmp-plugin"
              + namespace                  = "argocd"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
        }
    }

  # module.argocd.kubernetes_manifest.argocd_gateway will be created
+ resource "kubernetes_manifest" "argocd_gateway" {
      + manifest = {
          + apiVersion = "networking.istio.io/v1beta1"
          + kind       = "VirtualService"
          + metadata   = {
              + name      = "argocd-vs"
              + namespace = "argocd"
            }
          + spec       = {
              + gateways = [
                  + "istio-system/istio-ingressgateway",
                ]
              + hosts    = [
                  + "argocd.goboolean.io",
                ]
              + http     = [
                  + {
                      + route = [
                          + {
                              + destination = {
                                  + host = "argocd-server.argocd.svc.cluster.local"
                                  + port = {
                                      + number = 80
                                    }
                                }
                            },
                        ]
                    },
                ]
            }
        }
      + object   = {
          + apiVersion = "networking.istio.io/v1beta1"
          + kind       = "VirtualService"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "argocd-vs"
              + namespace                  = "argocd"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + exportTo = (known after apply)
              + gateways = [
                  + "istio-system/istio-ingressgateway",
                ]
              + hosts    = [
                  + "argocd.goboolean.io",
                ]
              + http     = [
                  + {
                      + corsPolicy       = {
                          + allowCredentials    = (known after apply)
                          + allowHeaders        = (known after apply)
                          + allowMethods        = (known after apply)
                          + allowOrigin         = (known after apply)
                          + allowOrigins        = (known after apply)
                          + exposeHeaders       = (known after apply)
                          + maxAge              = (known after apply)
                          + unmatchedPreflights = (known after apply)
                        }
                      + delegate         = {
                          + name      = (known after apply)
                          + namespace = (known after apply)
                        }
                      + directResponse   = {
                          + body   = {
                              + bytes  = (known after apply)
                              + string = (known after apply)
                            }
                          + status = (known after apply)
                        }
                      + fault            = {
                          + abort = {
                              + grpcStatus = (known after apply)
                              + http2Error = (known after apply)
                              + httpStatus = (known after apply)
                              + percentage = {
                                  + value = (known after apply)
                                }
                            }
                          + delay = {
                              + exponentialDelay = (known after apply)
                              + fixedDelay       = (known after apply)
                              + percent          = (known after apply)
                              + percentage       = {
                                  + value = (known after apply)
                                }
                            }
                        }
                      + headers          = {
                          + request  = {
                              + add    = (known after apply)
                              + remove = (known after apply)
                              + set    = (known after apply)
                            }
                          + response = {
                              + add    = (known after apply)
                              + remove = (known after apply)
                              + set    = (known after apply)
                            }
                        }
                      + match            = (known after apply)
                      + mirror           = {
                          + host   = (known after apply)
                          + port   = {
                              + number = (known after apply)
                            }
                          + subset = (known after apply)
                        }
                      + mirrorPercent    = (known after apply)
                      + mirrorPercentage = {
                          + value = (known after apply)
                        }
                      + mirror_percent   = (known after apply)
                      + mirrors          = (known after apply)
                      + name             = (known after apply)
                      + redirect         = {
                          + authority    = (known after apply)
                          + derivePort   = (known after apply)
                          + port         = (known after apply)
                          + redirectCode = (known after apply)
                          + scheme       = (known after apply)
                          + uri          = (known after apply)
                        }
                      + retries          = {
                          + attempts              = (known after apply)
                          + perTryTimeout         = (known after apply)
                          + retryOn               = (known after apply)
                          + retryRemoteLocalities = (known after apply)
                        }
                      + rewrite          = {
                          + authority       = (known after apply)
                          + uri             = (known after apply)
                          + uriRegexRewrite = {
                              + match   = (known after apply)
                              + rewrite = (known after apply)
                            }
                        }
                      + route            = [
                          + {
                              + destination = {
                                  + host   = "argocd-server.argocd.svc.cluster.local"
                                  + port   = {
                                      + number = 80
                                    }
                                  + subset = (known after apply)
                                }
                              + headers     = {
                                  + request  = {
                                      + add    = (known after apply)
                                      + remove = (known after apply)
                                      + set    = (known after apply)
                                    }
                                  + response = {
                                      + add    = (known after apply)
                                      + remove = (known after apply)
                                      + set    = (known after apply)
                                    }
                                }
                              + weight      = (known after apply)
                            },
                        ]
                      + timeout          = (known after apply)
                    },
                ]
              + tcp      = (known after apply)
              + tls      = (known after apply)
            }
        }
    }

  # module.argocd.kubernetes_secret.argocd_vault_plugin_credentials will be created
+ resource "kubernetes_secret" "argocd_vault_plugin_credentials" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd-vault-plugin-credentials"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.etcd.helm_release.etcd will be destroyed
  # (because helm_release.etcd is not in configuration)
- resource "helm_release" "etcd" {
      - atomic                     = false -> null
      - chart                      = "etcd" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = false -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "etcd" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = [
          - {
              - app_version    = "3.5.18"
              - chart          = "etcd"
              - first_deployed = 1738431512
              - last_deployed  = 1738431512
              - name           = "etcd"
              - namespace      = "etcd"
              - notes          = <<-EOT
                    CHART NAME: etcd
                    CHART VERSION: 11.0.5
                    APP VERSION: 3.5.18
                    
                    Did you know there are enterprise versions of the Bitnami catalog? For enhanced secure software supply chain features, unlimited pulls from Docker, LTS support, or application customization, see Bitnami Premium or Tanzu Application Catalog. See https://www.arrow.com/globalecs/na/vendors/bitnami for more information.
                    
                    ** Please be patient while the chart is being deployed **
                    
                    etcd can be accessed via port 2379 on the following DNS name from within your cluster:
                    
                        etcd.etcd.svc.cluster.local
                    
                    To create a pod that you can use as a etcd client run the following command:
                    
                        kubectl run etcd-client --restart='Never' --image docker.io/bitnami/etcd:3.5.18-debian-12-r0 --env ETCDCTL_ENDPOINTS="etcd.etcd.svc.cluster.local:2379" --namespace etcd --command -- sleep infinity
                    
                    Then, you can set/get a key using the commands below:
                    
                        kubectl exec --namespace etcd -it etcd-client -- bash
                        etcdctl  put /message Hello
                        etcdctl  get /message
                    
                    To connect to your etcd server from outside the cluster execute the following commands:
                    
                        kubectl port-forward --namespace etcd svc/etcd 2379:2379 &
                        echo "etcd URL: http://127.0.0.1:2379"
                    
                    WARNING: There are "resources" sections in the chart not set. Using "resourcesPreset" is not recommended for production. For production installations, please set the following values according to your workload needs:
                      - disasterRecovery.cronjob.resources
                      - resources
                    +info https://kubernetes.io/docs/concepts/configuration/manage-resources-containers/
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - affinity                             = {}
                      - args                                 = []
                      - auth                                 = {
                          - client = {
                              - caFilename           = ""
                              - certFilename         = "cert.pem"
                              - certKeyFilename      = "key.pem"
                              - enableAuthentication = false
                              - existingSecret       = ""
                              - secureTransport      = false
                              - useAutoTLS           = false
                            }
                          - peer   = {
                              - caFilename           = ""
                              - certFilename         = "cert.pem"
                              - certKeyFilename      = "key.pem"
                              - enableAuthentication = false
                              - existingSecret       = ""
                              - secureTransport      = false
                              - useAutoTLS           = false
                            }
                          - rbac   = {
                              - allowNoneAuthentication   = true
                              - create                    = false
                              - existingSecret            = ""
                              - existingSecretPasswordKey = ""
                              - rootPassword              = ""
                            }
                          - token  = {
                              - enabled    = true
                              - privateKey = {
                                  - existingSecret = ""
                                  - filename       = "jwt-token.pem"
                                }
                              - signMethod = "RS256"
                              - ttl        = "10m"
                              - type       = "jwt"
                            }
                        }
                      - autoCompactionMode                   = ""
                      - autoCompactionRetention              = ""
                      - automountServiceAccountToken         = false
                      - clusterDomain                        = "cluster.local"
                      - command                              = []
                      - commonAnnotations                    = {}
                      - commonLabels                         = {}
                      - configuration                        = ""
                      - containerPorts                       = {
                          - client  = 2379
                          - metrics = 9090
                          - peer    = 2380
                        }
                      - containerSecurityContext             = {
                          - allowPrivilegeEscalation = false
                          - capabilities             = {
                              - drop = [
                                  - "ALL",
                                ]
                            }
                          - enabled                  = true
                          - privileged               = false
                          - readOnlyRootFilesystem   = true
                          - runAsGroup               = 1001
                          - runAsNonRoot             = true
                          - runAsUser                = 1001
                          - seLinuxOptions           = {}
                          - seccompProfile           = {
                              - type = "RuntimeDefault"
                            }
                        }
                      - customLivenessProbe                  = {}
                      - customReadinessProbe                 = {}
                      - customStartupProbe                   = {}
                      - defrag                               = {
                          - cronjob = {
                              - activeDeadlineSeconds      = ""
                              - annotations                = {}
                              - args                       = []
                              - command                    = []
                              - concurrencyPolicy          = "Forbid"
                              - containerSecurityContext   = {
                                  - allowPrivilegeEscalation = false
                                  - capabilities             = {
                                      - drop = [
                                          - "ALL",
                                        ]
                                    }
                                  - enabled                  = true
                                  - privileged               = false
                                  - readOnlyRootFilesystem   = true
                                  - runAsGroup               = 1001
                                  - runAsNonRoot             = true
                                  - runAsUser                = 1001
                                  - seLinuxOptions           = {}
                                  - seccompProfile           = {
                                      - type = "RuntimeDefault"
                                    }
                                }
                              - failedJobsHistoryLimit     = 1
                              - labels                     = {}
                              - nodeSelector               = {}
                              - podAnnotations             = {}
                              - podLabels                  = {}
                              - podSecurityContext         = {
                                  - enabled             = true
                                  - fsGroup             = 1001
                                  - fsGroupChangePolicy = "Always"
                                  - supplementalGroups  = []
                                  - sysctls             = []
                                }
                              - resources                  = {}
                              - resourcesPreset            = "nano"
                              - restartPolicy              = "OnFailure"
                              - schedule                   = "0 0 * * *"
                              - serviceAccountName         = ""
                              - startingDeadlineSeconds    = ""
                              - successfulJobsHistoryLimit = 1
                              - suspend                    = false
                              - tolerations                = []
                            }
                          - enabled = false
                        }
                      - diagnosticMode                       = {
                          - args    = [
                              - "infinity",
                            ]
                          - command = [
                              - "sleep",
                            ]
                          - enabled = false
                        }
                      - disasterRecovery                     = {
                          - cronjob = {
                              - command                  = []
                              - containerSecurityContext = {
                                  - allowPrivilegeEscalation = false
                                  - capabilities             = {
                                      - drop = [
                                          - "ALL",
                                        ]
                                    }
                                  - enabled                  = true
                                  - privileged               = false
                                  - readOnlyRootFilesystem   = true
                                  - runAsGroup               = 1001
                                  - runAsNonRoot             = true
                                  - runAsUser                = 1001
                                  - seLinuxOptions           = {}
                                  - seccompProfile           = {
                                      - type = "RuntimeDefault"
                                    }
                                }
                              - historyLimit             = 1
                              - nodeSelector             = {}
                              - podAnnotations           = {}
                              - podLabels                = {}
                              - podSecurityContext       = {
                                  - enabled             = true
                                  - fsGroup             = 1001
                                  - fsGroupChangePolicy = "Always"
                                  - supplementalGroups  = []
                                  - sysctls             = []
                                }
                              - resources                = {}
                              - resourcesPreset          = "nano"
                              - schedule                 = "*/30 * * * *"
                              - serviceAccountName       = ""
                              - snapshotHistoryLimit     = 1
                              - snapshotsDir             = "/snapshots"
                              - tolerations              = []
                            }
                          - enabled = false
                          - pvc     = {
                              - existingClaim    = ""
                              - size             = "2Gi"
                              - storageClassName = "nfs"
                              - subPath          = ""
                            }
                        }
                      - existingConfigmap                    = ""
                      - extraDeploy                          = []
                      - extraEnvVars                         = []
                      - extraEnvVarsCM                       = ""
                      - extraEnvVarsSecret                   = ""
                      - extraVolumeClaimTemplates            = []
                      - extraVolumeMounts                    = []
                      - extraVolumes                         = []
                      - fullnameOverride                     = ""
                      - global                               = {
                          - compatibility       = {
                              - openshift = {
                                  - adaptSecurityContext = "auto"
                                }
                            }
                          - defaultStorageClass = ""
                          - imagePullSecrets    = []
                          - imageRegistry       = ""
                          - security            = {
                              - allowInsecureImages = false
                            }
                          - storageClass        = ""
                        }
                      - hostAliases                          = []
                      - image                                = {
                          - debug       = false
                          - digest      = ""
                          - pullPolicy  = "IfNotPresent"
                          - pullSecrets = []
                          - registry    = "docker.io"
                          - repository  = "bitnami/etcd"
                          - tag         = "3.5.18-debian-12-r0"
                        }
                      - initContainers                       = []
                      - initialClusterToken                  = "etcd-cluster-k8s"
                      - kubeVersion                          = ""
                      - lifecycleHooks                       = {}
                      - livenessProbe                        = {
                          - enabled             = true
                          - failureThreshold    = 5
                          - initialDelaySeconds = 60
                          - periodSeconds       = 30
                          - successThreshold    = 1
                          - timeoutSeconds      = 5
                        }
                      - logLevel                             = "info"
                      - maxProcs                             = ""
                      - metrics                              = {
                          - enabled             = false
                          - podAnnotations      = {
                              - "prometheus.io/port"   = "{{ .Values.metrics.useSeparateEndpoint | ternary .Values.containerPorts.metrics .Values.containerPorts.client }}"
                              - "prometheus.io/scrape" = "true"
                            }
                          - podMonitor          = {
                              - additionalLabels = {}
                              - enabled          = false
                              - interval         = "30s"
                              - namespace        = "monitoring"
                              - relabelings      = []
                              - scheme           = "http"
                              - scrapeTimeout    = "30s"
                              - tlsConfig        = {}
                            }
                          - prometheusRule      = {
                              - additionalLabels = {}
                              - enabled          = false
                              - namespace        = ""
                              - rules            = []
                            }
                          - useSeparateEndpoint = false
                        }
                      - nameOverride                         = ""
                      - networkPolicy                        = {
                          - allowExternal           = true
                          - allowExternalEgress     = true
                          - enabled                 = true
                          - extraEgress             = []
                          - extraIngress            = []
                          - ingressNSMatchLabels    = {}
                          - ingressNSPodMatchLabels = {}
                        }
                      - nodeAffinityPreset                   = {
                          - key    = ""
                          - type   = ""
                          - values = []
                        }
                      - nodeSelector                         = {}
                      - pdb                                  = {
                          - create         = true
                          - maxUnavailable = ""
                          - minAvailable   = "51%"
                        }
                      - persistence                          = {
                          - accessModes  = [
                              - "ReadWriteOnce",
                            ]
                          - annotations  = {}
                          - enabled      = true
                          - labels       = {}
                          - selector     = {}
                          - size         = "8Gi"
                          - storageClass = ""
                        }
                      - persistentVolumeClaimRetentionPolicy = {
                          - enabled     = false
                          - whenDeleted = "Retain"
                          - whenScaled  = "Retain"
                        }
                      - podAffinityPreset                    = ""
                      - podAnnotations                       = {}
                      - podAntiAffinityPreset                = "soft"
                      - podLabels                            = {}
                      - podManagementPolicy                  = "Parallel"
                      - podSecurityContext                   = {
                          - enabled             = true
                          - fsGroup             = 1001
                          - fsGroupChangePolicy = "Always"
                          - supplementalGroups  = []
                          - sysctls             = []
                        }
                      - priorityClassName                    = ""
                      - readinessProbe                       = {
                          - enabled             = true
                          - failureThreshold    = 5
                          - initialDelaySeconds = 60
                          - periodSeconds       = 10
                          - successThreshold    = 1
                          - timeoutSeconds      = 5
                        }
                      - replicaCount                         = 3
                      - resources                            = {}
                      - resourcesPreset                      = "micro"
                      - runtimeClassName                     = ""
                      - schedulerName                        = ""
                      - service                              = {
                          - annotations              = {}
                          - clientPortNameOverride   = ""
                          - clusterIP                = ""
                          - enabled                  = true
                          - externalIPs              = []
                          - externalTrafficPolicy    = "Cluster"
                          - extraPorts               = []
                          - headless                 = {
                              - annotations = {}
                            }
                          - loadBalancerClass        = ""
                          - loadBalancerIP           = ""
                          - loadBalancerSourceRanges = []
                          - metricsPortNameOverride  = ""
                          - nodePorts                = {
                              - client  = ""
                              - metrics = ""
                              - peer    = ""
                            }
                          - peerPortNameOverride     = ""
                          - ports                    = {
                              - client  = 2379
                              - metrics = 9090
                              - peer    = 2380
                            }
                          - sessionAffinity          = "None"
                          - sessionAffinityConfig    = {}
                          - type                     = "ClusterIP"
                        }
                      - serviceAccount                       = {
                          - annotations                  = {}
                          - automountServiceAccountToken = false
                          - create                       = true
                          - labels                       = {}
                          - name                         = ""
                        }
                      - shareProcessNamespace                = false
                      - sidecars                             = []
                      - startFromSnapshot                    = {
                          - enabled          = false
                          - existingClaim    = ""
                          - snapshotFilename = ""
                        }
                      - startupProbe                         = {
                          - enabled             = false
                          - failureThreshold    = 60
                          - initialDelaySeconds = 0
                          - periodSeconds       = 10
                          - successThreshold    = 1
                          - timeoutSeconds      = 5
                        }
                      - terminationGracePeriodSeconds        = ""
                      - tolerations                          = []
                      - topologySpreadConstraints            = []
                      - updateStrategy                       = {
                          - type = "RollingUpdate"
                        }
                      - volumePermissions                    = {
                          - enabled         = false
                          - image           = {
                              - digest      = ""
                              - pullPolicy  = "IfNotPresent"
                              - pullSecrets = []
                              - registry    = "docker.io"
                              - repository  = "bitnami/os-shell"
                              - tag         = "12-debian-12-r35"
                            }
                          - resources       = {}
                          - resourcesPreset = "nano"
                        }
                    }
                )
              - version        = "11.0.5"
            },
        ] -> null
      - name                       = "etcd" -> null
      - namespace                  = "etcd" -> null
      - pass_credentials           = false -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "oci://registry-1.docker.io/bitnamicharts" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 600 -> null
      - values                     = [
          - <<-EOT
                # Copyright Broadcom, Inc. All Rights Reserved.
                # SPDX-License-Identifier: APACHE-2.0
                
                ## @section Global parameters
                ## Global Docker image parameters
                ## Please, note that this will override the image parameters, including dependencies, configured to use the global value
                ## Current available global Docker image parameters: imageRegistry, imagePullSecrets and storageClass
                ##
                
                ## @param global.imageRegistry Global Docker image registry
                ## @param global.imagePullSecrets [array] Global Docker registry secret names as an array
                ## @param global.defaultStorageClass Global default StorageClass for Persistent Volume(s)
                ## @param global.storageClass DEPRECATED: use global.defaultStorageClass instead
                ##
                global:
                  imageRegistry: ""
                  ## E.g.
                  ## imagePullSecrets:
                  ##   - myRegistryKeySecretName
                  ##
                  imagePullSecrets: []
                  defaultStorageClass: ""
                  storageClass: ""
                  ## Security parameters
                  ##
                  security:
                    ## @param global.security.allowInsecureImages Allows skipping image verification
                    allowInsecureImages: false
                  ## Compatibility adaptations for Kubernetes platforms
                  ##
                  compatibility:
                    ## Compatibility adaptations for Openshift
                    ##
                    openshift:
                      ## @param global.compatibility.openshift.adaptSecurityContext Adapt the securityContext sections of the deployment to make them compatible with Openshift restricted-v2 SCC: remove runAsUser, runAsGroup and fsGroup and let the platform use their allowed default IDs. Possible values: auto (apply if the detected running cluster is Openshift), force (perform the adaptation always), disabled (do not perform adaptation)
                      ##
                      adaptSecurityContext: auto
                ## @section Common parameters
                ##
                
                ## @param kubeVersion Force target Kubernetes version (using Helm capabilities if not set)
                ##
                kubeVersion: ""
                ## @param nameOverride String to partially override common.names.fullname template (will maintain the release name)
                ##
                nameOverride: ""
                ## @param fullnameOverride String to fully override common.names.fullname template
                ##
                fullnameOverride: ""
                ## @param commonLabels [object] Labels to add to all deployed objects
                ##
                commonLabels: {}
                ## @param commonAnnotations [object] Annotations to add to all deployed objects
                ##
                commonAnnotations: {}
                ## @param clusterDomain Default Kubernetes cluster domain
                ##
                clusterDomain: cluster.local
                ## @param extraDeploy [array] Array of extra objects to deploy with the release
                ##
                extraDeploy: []
                ## Enable diagnostic mode in the deployment
                ##
                diagnosticMode:
                  ## @param diagnosticMode.enabled Enable diagnostic mode (all probes will be disabled and the command will be overridden)
                  ##
                  enabled: false
                  ## @param diagnosticMode.command Command to override all containers in the deployment
                  ##
                  command:
                    - sleep
                  ## @param diagnosticMode.args Args to override all containers in the deployment
                  ##
                  args:
                    - infinity
                ## @section etcd parameters
                ##
                
                ## Bitnami etcd image version
                ## ref: https://hub.docker.com/r/bitnami/etcd/tags/
                ## @param image.registry [default: REGISTRY_NAME] etcd image registry
                ## @param image.repository [default: REPOSITORY_NAME/etcd] etcd image name
                ## @skip image.tag etcd image tag
                ## @param image.digest etcd image digest in the way sha256:aa.... Please note this parameter, if set, will override the tag
                ##
                image:
                  registry: docker.io
                  repository: bitnami/etcd
                  tag: 3.5.18-debian-12-r0
                  digest: ""
                  ## @param image.pullPolicy etcd image pull policy
                  ## Specify a imagePullPolicy
                  ## ref: https://kubernetes.io/docs/concepts/containers/images/#pre-pulled-images
                  ##
                  pullPolicy: IfNotPresent
                  ## @param image.pullSecrets [array] etcd image pull secrets
                  ## Optionally specify an array of imagePullSecrets.
                  ## Secrets must be manually created in the namespace.
                  ## ref: https://kubernetes.io/docs/tasks/configure-pod-container/pull-image-private-registry/
                  ## e.g:
                  ## pullSecrets:
                  ##   - myRegistryKeySecretName
                  ##
                  pullSecrets: []
                  ## @param image.debug Enable image debug mode
                  ## Set to true if you would like to see extra information on logs
                  ##
                  debug: false
                ## Authentication parameters
                ##
                auth:
                  ## Role-based access control parameters
                  ## ref: https://etcd.io/docs/current/op-guide/authentication/
                  ##
                  rbac:
                    ## @param auth.rbac.create Switch to enable RBAC authentication
                    ##
                    create: false
                    ## @param auth.rbac.allowNoneAuthentication Allow to use etcd without configuring RBAC authentication
                    ##
                    allowNoneAuthentication: true
                    ## @param auth.rbac.rootPassword Root user password. The root user is always `root`
                    ##
                    rootPassword: ""
                    ## @param auth.rbac.existingSecret Name of the existing secret containing credentials for the root user
                    ##
                    existingSecret: ""
                    ## @param auth.rbac.existingSecretPasswordKey Name of key containing password to be retrieved from the existing secret
                    ##
                    existingSecretPasswordKey: ""
                  ## Authentication token
                  ## ref: https://etcd.io/docs/latest/learning/design-auth-v3/#two-types-of-tokens-simple-and-jwt
                  ##
                  token:
                    ## @param auth.token.enabled Enables token authentication
                    ##
                    enabled: true
                    ## @param auth.token.type Authentication token type. Allowed values: 'simple' or 'jwt'
                    ## ref: https://etcd.io/docs/latest/op-guide/configuration/#--auth-token
                    ##
                    type: jwt
                    ## @param auth.token.privateKey.filename Name of the file containing the private key for signing the JWT token
                    ## @param auth.token.privateKey.existingSecret Name of the existing secret containing the private key for signing the JWT token
                    ## NOTE: Ignored if auth.token.type=simple
                    ## NOTE: A secret containing a private key will be auto-generated if an existing one is not provided.
                    ##
                    privateKey:
                      filename: jwt-token.pem
                      existingSecret: ""
                    ## @param auth.token.signMethod JWT token sign method
                    ## NOTE: Ignored if auth.token.type=simple
                    ##
                    signMethod: RS256
                    ## @param auth.token.ttl JWT token TTL
                    ## NOTE: Ignored if auth.token.type=simple
                    ##
                    ttl: 10m
                  ## TLS authentication for client-to-server communications
                  ## ref: https://etcd.io/docs/current/op-guide/security/
                  ##
                  client:
                    ## @param auth.client.secureTransport Switch to encrypt client-to-server communications using TLS certificates
                    ##
                    secureTransport: false
                    ## @param auth.client.useAutoTLS Switch to automatically create the TLS certificates
                    ##
                    useAutoTLS: false
                    ## @param auth.client.existingSecret Name of the existing secret containing the TLS certificates for client-to-server communications
                    ##
                    existingSecret: ""
                    ## @param auth.client.enableAuthentication Switch to enable host authentication using TLS certificates. Requires existing secret
                    ##
                    enableAuthentication: false
                    ## @param auth.client.certFilename Name of the file containing the client certificate
                    ##
                    certFilename: cert.pem
                    ## @param auth.client.certKeyFilename Name of the file containing the client certificate private key
                    ##
                    certKeyFilename: key.pem
                    ## @param auth.client.caFilename Name of the file containing the client CA certificate
                    ## If not specified and `auth.client.enableAuthentication=true` or `auth.rbac.enabled=true`, the default is is `ca.crt`
                    ##
                    caFilename: ""
                  ## TLS authentication for server-to-server communications
                  ## ref: https://etcd.io/docs/current/op-guide/security/
                  ##
                  peer:
                    ## @param auth.peer.secureTransport Switch to encrypt server-to-server communications using TLS certificates
                    ##
                    secureTransport: false
                    ## @param auth.peer.useAutoTLS Switch to automatically create the TLS certificates
                    ##
                    useAutoTLS: false
                    ## @param auth.peer.existingSecret Name of the existing secret containing the TLS certificates for server-to-server communications
                    ##
                    existingSecret: ""
                    ## @param auth.peer.enableAuthentication Switch to enable host authentication using TLS certificates. Requires existing secret
                    ##
                    enableAuthentication: false
                    ## @param auth.peer.certFilename Name of the file containing the peer certificate
                    ##
                    certFilename: cert.pem
                    ## @param auth.peer.certKeyFilename Name of the file containing the peer certificate private key
                    ##
                    certKeyFilename: key.pem
                    ## @param auth.peer.caFilename Name of the file containing the peer CA certificate
                    ## If not specified and `auth.peer.enableAuthentication=true` or `rbac.enabled=true`, the default is is `ca.crt`
                    ##
                    caFilename: ""
                ## @param autoCompactionMode Auto compaction mode, by default periodic. Valid values: "periodic", "revision".
                ## - 'periodic' for duration based retention, defaulting to hours if no time unit is provided (e.g. 5m).
                ## - 'revision' for revision number based retention.
                ##
                autoCompactionMode: ""
                ## @param autoCompactionRetention Auto compaction retention for mvcc key value store in hour, by default 0, means disabled
                ##
                autoCompactionRetention: ""
                ## @param initialClusterToken Initial cluster token. Can be used to protect etcd from cross-cluster-interaction, which might corrupt the clusters.
                ## If spinning up multiple clusters (or creating and destroying a single cluster)
                ## with same configuration for testing purpose, it is highly recommended that each cluster is given a unique initial-cluster-token.
                ## By doing this, etcd can generate unique cluster IDs and member IDs for the clusters even if they otherwise have the exact same configuration.
                ##
                initialClusterToken: "etcd-cluster-k8s"
                ## @param logLevel Sets the log level for the etcd process. Allowed values: 'debug', 'info', 'warn', 'error', 'panic', 'fatal'
                ##
                logLevel: "info"
                ## @param maxProcs Limits the number of operating system threads that can execute user-level
                ## Go code simultaneously by setting GOMAXPROCS environment variable
                ## ref: https://golang.org/pkg/runtime
                ##
                maxProcs: ""
                ## @param configuration etcd configuration. Specify content for etcd.conf.yml
                ## e.g:
                ## configuration: |-
                ##    foo: bar
                ##    baz:
                ##
                configuration: ""
                ## @param existingConfigmap Existing ConfigMap with etcd configuration
                ## NOTE: When it's set the configuration parameter is ignored
                ##
                existingConfig
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.